In [87]:
import pandas as pd
import numpy as np

In [88]:
file = "boston/calendar.csv"
df = pd.read_csv(file)
df.head()

,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,5245,2019-03-08,f,$150.00,$150.00,28,180
1,2265,2019-03-08,f,$225.00,$225.00,2,183
2,2265,2019-03-09,f,$275.00,$275.00,2,183
3,2265,2019-03-10,f,$275.00,$275.00,2,183
4,2265,2019-03-11,f,$275.00,$275.00,2,183

In [89]:
df1 = df.drop(columns = ['available', 'minimum_nights', 'maximum_nights'])

In [90]:
df1_group = df1.set_index('listing_id')

In [91]:
df1_group['date'] = pd.to_datetime(df1_group['date'])

In [92]:
df1_group['YEAR'] = df1_group['date'].dt.year
df1_group['MONTH'] = df1_group['date'].dt.month
df1_group = df1_group.reset_index()

In [93]:
df1_group.head()

   listing_id       date    price adjusted_price  YEAR  MONTH
0        5245 2019-03-08  $150.00        $150.00  2019      3
1        2265 2019-03-08  $225.00        $225.00  2019      3
2        2265 2019-03-09  $275.00        $275.00  2019      3
3        2265 2019-03-10  $275.00        $275.00  2019      3
4        2265 2019-03-11  $275.00        $275.00  2019      3

In [94]:
df1_group['price'].astype(str)
df1_group['price'] = df1_group.price.str.replace('$', '')
df1_group['price'] = df1_group.price.str.replace(',', '')
df1_group['price'] = df1_group['price'].astype(float)

In [95]:
df1_group.dtypes

listing_id                 int64
date              datetime64[ns]
price                    float64
adjusted_price            object
YEAR                       int64
MONTH                      int64
dtype: object

In [96]:
df_month = df1_group.groupby(['MONTH']).mean()

In [97]:
df_month

         listing_id       price    YEAR
MONTH
1      1.787311e+07  312.395117  2020.0
2      1.787311e+07  315.656526  2020.0
3      1.787311e+07  312.197105  2019.2
4      1.787311e+07  277.565573  2019.0
5      1.787311e+07  279.152794  2019.0
6      1.787311e+07  276.951559  2019.0
7      1.787311e+07  280.186273  2019.0
8      1.787311e+07  286.718057  2019.0
9      1.787311e+07  301.837591  2019.0
10     1.787311e+07  314.702979  2019.0
11     1.787311e+07  308.658810  2019.0
12     1.787311e+07  305.943100  2019.0

In [101]:
df_month['city'] = 'austin'

In [98]:
df_month = df_month.drop(columns = ['listing_id', 'YEAR'])

In [100]:
df_month.to_csv('austin_clean.csv')